tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/core"

brew "carthage"
brew "diff-so-fancy"
brew "direnv"
brew "elixir"
brew "git"
brew "go"
brew "hugo"
brew "jq"
brew "kubernetes-cli"
brew "libpq"
brew "lolcat"
brew "mas"
brew "rbenv"
brew "swiftlint"
brew "the_silver_searcher"
brew "tldr"
brew "tree"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "github/gh/gh"

# Casks
cask "1password"
cask "adobe-creative-cloud"
cask "alfred"
cask "bartender"
cask "cakebrew"
cask "docker"
cask "dropbox"
cask "google-chrome"
cask "iterm2"
cask "postman"
cask "spotify"
cask "steam"
cask "visual-studio-code"

# Font casks
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-icomoon"
cask "font-im-fell-types"
cask "font-ionicons"
cask "font-jetbrains-mono"
cask "font-inconsolata-for-powerline"
cask "font-material-icons"
cask "font-materialdesignicons-webfont"
cask "font-meslo-for-powerline"
cask "font-noto-mono-for-powerline"
cask "font-open-iconic"
cask "font-powerline-symbols"

# MAS Apps
mas "Fantastical", id: 975937182
mas "Gifski", id: 1351639930
mas "Kelir", id: 1145215534
mas "Soulver", id: 413965349
mas "Spark", id: 1176895641
mas "Super Resize", id: 1023220867
mas "The Clock", id: 488764545
mas "Tot", id: 1491071483
mas "Xcode", id: 497799835
